# Neeps - Resit

In [1]:
# Prerequesites
from pyhive import hive
%load_ext sql
%sql hive://cloudera@quickstart.cloudera:10000/sqlzoo
%config SqlMagic.displaylimit = 20

 ·········

## 1.
**Give the day and the time of the event co72002.L01.**

In [2]:
%%sql
SELECT dow, tod FROM ut_event
  WHERE id='co72002.L01';

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[('Monday', '10:00')]

## 2.
**For each event in module co72003 show the day, the time and the place.**

In [3]:
%%sql
SELECT ut_event.id, dow, tod, room FROM ut_event
  WHERE ut_event.modle='co72003';

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[('co72003.L01', 'Monday', '14:00', 'cr.B12')]

## 3.
**List the id of the events taught by 'Chisholm, Ken'.**

In [4]:
%%sql
SELECT ut_event.id
  FROM ut_event JOIN ut_teaches ON (
    ut_event.id=ut_teaches.event) JOIN
    ut_staff ON (ut_teaches.staff=ut_staff.id)
    WHERE ut_staff.name='Chisholm, Ken';

 * postgresql://postgres:***@localhost/sqlzoo
10 rows affected.

[('co22006.L01',),
 ('co22006.L02',),
 ('co22006.L03',),
 ('co22006.T01',),
 ('co22006.T02',),
 ('co72013.L01',),
 ('co72013.L02',),
 ('co72013.T01',),
 ('co72013.T02',),
 ('co72013.T06',)]

## 4.
**List the staff who teach in cr.SMH.**

In [5]:
%%sql
SELECT DISTINCT ut_staff.name
  FROM ut_staff JOIN ut_teaches ON (
    ut_staff.id=ut_teaches.staff) JOIN
    ut_event ON (ut_event.id=ut_teaches.event)
    WHERE room='cr.SMH'
    ORDER BY ut_staff.name;

 * postgresql://postgres:***@localhost/sqlzoo
16 rows affected.

[('Barclay, Ken',),
 ('Chisholm, Ken',),
 ('Cumming, Andrew',),
 ('Greig, Frank',),
 ('Hastie, Colin',),
 ('Jackson, Jim',),
 ('Kemmer, Rob',),
 ('Lawson, Alistair',),
 ('Macaulay, Catriona',),
 ('Maclean, Aileen',),
 ('McEwan, Tom',),
 ('Middleton, Steve',),
 ('Smith, Ian',),
 ('Smyth, Michael',),
 ('Soutar, Alastair',),
 ('Turner, Susan',)]

## 5.
**Show the total number of hours (over the whole semester) of classes for com.IS.a**

In [6]:
%%sql
SELECT SUM(duration) hrs
  FROM ut_event JOIN ut_occurs ON (
    ut_event.id=ut_occurs.event) JOIN
    ut_attends ON (ut_attends.event=ut_event.id)
    WHERE student='com.IS.a';

 * postgresql://postgres:***@localhost/sqlzoo
1 rows affected.

[(60,)]